Revit 2027 API
BuiltInFailures.ColumnInsideWallFailures.ColumnInsideWall Property
 One element is completely inside another.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ColumnInsideWall { get; }
Public Shared ReadOnly Property ColumnInsideWall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ColumnInsideWall {
	FailureDefinitionId^ get ();
}
static member ColumnInsideWall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ColumnInsideWallFailures Class
Autodesk.Revit.DB Namespace